#+TITLE: Ryan's Time Log
#+AUTHOR: Ryan Szemplinski
#+DATE: Spring 2014
#+STARTUP: content indent logdrawer lognoteclock-out lognotedone

*** TODO Class time for the week of the 16th                     :rszempli:
CLOCK: [2014-02-18 Tue 15:22]--[2014-02-18 Tue 15:49] =>  0:27
- Some more class time
CLOCK: [2014-02-18 Tue 14:57]--[2014-02-18 Tue 15:20] =>  0:23
- More class time
CLOCK: [2014-02-18 Tue 13:40]--[2014-02-18 Tue 14:32] =>  0:52
- Class time
*** TODO Django tutorials                                        :rszempli:
**** TODO Go through the main site tutorial [4/5] [80%]
:LOGBOOK:
CLOCK: [2014-02-19 Wed 22:06]--[2014-02-19 Wed 23:39] =>  1:33
- Learned some about making some models and the very sexy database viewer
  web page thing and some url stuffzzzz....
:END:
- [X] Part 1
- [X] Part 2
- [X] Part 3
- [X] Part 4
- [ ] Part 5
*** TODO Get more experience with org-mode                       :rszempli:
**** TODO Look at more tutorials on it[1/3]
- [X] Learn more hotkeys
- [ ] Memorize the hotkeys
- [ ] Learn to like org-mode
*** TODO Tutorial on Angular.js [[http://docs.angularjs.org/api][Documentation]]                    :rszempli:
